### 1. Importações

In [1]:
import pandas as pd

ModuleNotFoundError: No module named 'pandas'

In [ ]:
df_channels = pd.read_csv(r'C:\Users\Usuario\Documents\TREINAMENTO\PJ_treinamento3_24.0\Previsao-main\Previsao-main\channels.csv')

df_channels

    channel_id channel_type
0            1  OWN CHANNEL
1            2  OWN CHANNEL
2            3  OWN CHANNEL
3            4  OWN CHANNEL
4            5  MARKETPLACE
5            6  OWN CHANNEL
6            7  OWN CHANNEL
7            8  OWN CHANNEL
8            9  OWN CHANNEL
9           10  OWN CHANNEL
10          11  OWN CHANNEL
11          12  MARKETPLACE
12          13  MARKETPLACE
13          15  MARKETPLACE
14          17  MARKETPLACE
15          20  MARKETPLACE
16          21  MARKETPLACE
17          23  MARKETPLACE
18          24  MARKETPLACE
19          25  MARKETPLACE
20          28  MARKETPLACE
21          29  MARKETPLACE
22          30  MARKETPLACE
23          31  MARKETPLACE
24          32  MARKETPLACE
25          33  MARKETPLACE
26          34  MARKETPLACE
27          35  MARKETPLACE
28          36  OWN CHANNEL
29          37  MARKETPLACE
30          38  MARKETPLACE
31          39  MARKETPLACE
32          41  MARKETPLACE
33          42  MARKETPLACE
34          43  MARKETPLACE
35          44  OWN CHANNEL
36          46  OWN CHANNEL
37          47  MARKETPLACE
38          48  MARKETPLACE
39          49  OWN CHANNEL

In [ ]:
df_deliveries = pd.read_csv(r'C:\Users\Usuario\Documents\TREINAMENTO\PJ_treinamento3_24.0\Previsao-main\Previsao-main\deliveries.csv')

df_deliveries.head()

,delivery_id,delivery_order_id,driver_id,delivery_distance_meters,delivery_status
0,2174658,68413340,8378.0,5199.0,DELIVERED
1,2174660,68414309,2473.0,410.0,DELIVERED
2,2174661,68416230,7615.0,3784.0,DELIVERED
3,2174663,68412721,8378.0,5714.0,DELIVERED
4,2174675,68414018,10463.0,3746.0,DELIVERED

In [ ]:
df_drivers = pd.read_csv(r'C:\Users\Usuario\Documents\TREINAMENTO\PJ_treinamento3_24.0\Previsao-main\Previsao-main\drivers.csv')

df_drivers.head()

   driver_id driver_modal        driver_type
0        133      MOTOBOY  LOGISTIC OPERATOR
1        138      MOTOBOY          FREELANCE
2        140      MOTOBOY          FREELANCE
3        143        BIKER          FREELANCE
4        148      MOTOBOY          FREELANCE

In [ ]:
df_hubs = pd.read_csv(r'C:\Users\Usuario\Documents\TREINAMENTO\PJ_treinamento3_24.0\Previsao-main\Previsao-main\hubs.csv')

df_hubs

    hub_id        hub_city  hub_latitude  hub_longitude
0        2    PORTO ALEGRE    -30.047415     -51.213510
1        3    PORTO ALEGRE    -30.037415     -51.203520
2        4    PORTO ALEGRE    -30.021948     -51.208380
3        5  RIO DE JANEIRO    -23.000750     -43.318283
4        8  RIO DE JANEIRO    -22.921474     -43.234776
5       13  RIO DE JANEIRO    -22.885820     -43.279217
6       16  RIO DE JANEIRO    -23.017473     -43.479940
7       17       S�O PAULO    -23.592005     -46.636505
8       18  RIO DE JANEIRO    -22.945496     -43.182182
9       20  RIO DE JANEIRO    -22.996847     -43.359634
10      21       S�O PAULO    -23.550407     -46.697315
11      22  RIO DE JANEIRO    -23.000753     -43.383770
12      25       S�O PAULO    -23.567703     -46.642044
13      26       S�O PAULO    -23.563019     -46.652622
14      27       S�O PAULO    -23.622995     -46.699203
15      28       S�O PAULO    -23.595001     -46.685986
16      29       S�O PAULO    -23.561052     -46.558975
17      31       S�O PAULO    -23.629826     -46.735203
18      33       S�O PAULO    -23.579067     -46.592820
19      35  RIO DE JANEIRO    -22.969880     -43.370810
20      36    PORTO ALEGRE    -30.085743     -51.246000
21      37       S�O PAULO    -23.507105     -46.718197
22      42        CURITIBA    -25.438105     -49.266533
23      43        CURITIBA    -25.441221     -49.277690
24      44        CURITIBA    -25.435140     -49.316788
25      51  RIO DE JANEIRO    -22.923676     -43.567757
26      55       S�O PAULO    -23.521776     -46.624153
27      73       S�O PAULO    -22.947460     -43.183468
28      75        CURITIBA    -25.477074     -49.289660
29      85       S�O PAULO    -23.513353     -46.618355
30      86       S�O PAULO    -23.541502     -46.576620
31      91       S�O PAULO    -23.525124     -46.546806

In [ ]:
df_orders = pd.read_csv(r'C:\Users\Usuario\Documents\TREINAMENTO\PJ_treinamento3_24.0\Previsao-main\Previsao-main\orders.csv')

df_orders.head()

,order_id,store_id,channel_id,payment_order_id,delivery_order_id,order_status,order_amount,order_delivery_fee,order_delivery_cost,order_created_hour,...,order_moment_delivering,order_moment_delivered,order_moment_finished,order_metric_collected_time,order_metric_paused_time,order_metric_production_time,order_metric_walking_time,order_metric_expediton_speed_time,order_metric_transit_time,order_metric_cycle_time
0,89066010,624,5,89066010,89066010,FINISHED,64,6,5.0,15,...,4/9/2021 4:23:27 PM,NaN,4/9/2021 4:27:23 PM,4.0,4.0,20.0,8.0,12.0,3.0,37.0
1,74452603,658,5,74452603,74452603,FINISHED,74,11,6.0,21,...,1/29/2021 9:38:49 PM,NaN,1/29/2021 9:56:32 PM,0.0,0.0,15.0,3.0,4.0,17.0,37.0
2,78635930,371,5,78635930,78635930,FINISHED,82,9,8.0,20,...,2/18/2021 9:05:31 PM,NaN,2/18/2021 9:48:07 PM,1.0,6.0,4.0,4.0,11.0,42.0,58.0
3,70338727,1002,5,70338727,70338727,FINISHED,85,9,8.0,22,...,1/9/2021 10:51:37 PM,NaN,1/9/2021 11:13:46 PM,2.0,1.0,8.0,6.0,7.0,22.0,38.0
4,68874888,274,5,68874888,68874888,FINISHED,107,11,6.0,16,...,1/3/2021 4:52:26 PM,NaN,1/3/2021 5:07:33 PM,5.0,3.0,20.0,5.0,8.0,15.0,44.0

In [ ]:
df_orders.loc[df_orders['order_status'] == 'CANCELED']

obs: muitos pedidos cancelados

In [ ]:
df_payments = pd.read_csv(r'C:\Users\Usuario\Documents\TREINAMENTO\PJ_treinamento3_24.0\Previsao-main\Previsao-main\payments.csv')

df_payments.head()

,payment_id,payment_order_id,payment_amount,payment_fee,payment_method,payment_status
0,4427917,68410055,118.44,0.00,VOUCHER,PAID
1,4427918,68410055,394.81,7.90,ONLINE,PAID
2,4427941,68412721,206.95,5.59,ONLINE,PAID
3,4427948,68413340,58.80,1.59,ONLINE,PAID
4,4427955,68414018,45.80,0.92,ONLINE,PAID

In [ ]:
df_stores = pd.read_csv(r'C:\Users\Usuario\Documents\TREINAMENTO\PJ_treinamento3_24.0\Previsao-main\Previsao-main\stores.csv')

df_stores.head()

,store_id,hub_id,store_segment,store_plan_price,store_latitude,store_longitude
0,3,2,FOOD,0.0,NaN,NaN
1,6,3,FOOD,0.0,-30.037415,-51.20352
2,8,3,FOOD,0.0,-30.037415,-51.20352
3,53,8,FOOD,0.0,-22.921474,-43.23482
4,54,8,FOOD,0.0,-22.921474,-43.23482

### 2. Unindo as bases

In [ ]:
dfmerge1 = pd.merge(df_deliveries, df_drivers, on='driver_id')
dfmerge1.head()

,delivery_id,delivery_order_id,driver_id,delivery_distance_meters,delivery_status,driver_modal,driver_type
0,2174658,68413340,8378.0,5199.0,DELIVERED,MOTOBOY,FREELANCE
1,2174660,68414309,2473.0,410.0,DELIVERED,BIKER,FREELANCE
2,2174661,68416230,7615.0,3784.0,DELIVERED,MOTOBOY,LOGISTIC OPERATOR
3,2174663,68412721,8378.0,5714.0,DELIVERED,MOTOBOY,FREELANCE
4,2174675,68414018,10463.0,3746.0,DELIVERED,MOTOBOY,LOGISTIC OPERATOR

In [ ]:
dfmerge2 = pd.merge(df_stores, df_hubs, on='hub_id')
dfmerge2.head()

,store_id,hub_id,store_segment,store_plan_price,store_latitude,store_longitude,hub_city,hub_latitude,hub_longitude
0,3,2,FOOD,0.0,NaN,NaN,PORTO ALEGRE,-30.047415,-51.213510
1,6,3,FOOD,0.0,-30.037415,-51.20352,PORTO ALEGRE,-30.037415,-51.203520
2,8,3,FOOD,0.0,-30.037415,-51.20352,PORTO ALEGRE,-30.037415,-51.203520
3,53,8,FOOD,0.0,-22.921474,-43.23482,RIO DE JANEIRO,-22.921474,-43.234776
4,54,8,FOOD,0.0,-22.921474,-43.23482,RIO DE JANEIRO,-22.921474,-43.234776

In [ ]:
dfmerge = pd.merge(pd.merge(pd.merge(pd.merge(df_orders, df_channels, on='channel_id'), dfmerge1, on='delivery_order_id'), dfmerge2, on='store_id'), df_payments, on='payment_order_id')

dfmerge.head()

,order_id,store_id,channel_id,payment_order_id,delivery_order_id,order_status,order_amount,order_delivery_fee,order_delivery_cost,order_created_hour,...,store_latitude,store_longitude,hub_city,hub_latitude,hub_longitude,payment_id,payment_amount,payment_fee,payment_method,payment_status
0,89066010,624,5,89066010,89066010,FINISHED,64,6,5.0,15,...,-23.595776,-46.685986,S�O PAULO,-23.595001,-46.685986,5259866,71.22,1.07,ONLINE,PAID
1,74452603,658,5,74452603,74452603,FINISHED,74,11,6.0,21,...,-23.561052,-46.558975,S�O PAULO,-23.561052,-46.558975,4613781,86.80,2.34,ONLINE,PAID
2,78635930,371,5,78635930,78635930,FINISHED,82,9,8.0,20,...,-22.996847,-43.361200,RIO DE JANEIRO,-22.996847,-43.359634,4761448,92.80,1.39,ONLINE,PAID
3,70338727,1002,5,70338727,70338727,FINISHED,85,9,8.0,22,...,-22.996847,-43.361200,RIO DE JANEIRO,-22.996847,-43.359634,4480984,94.90,1.42,ONLINE,PAID
4,68874888,274,5,68874888,68874888,FINISHED,107,11,6.0,16,...,-23.017473,-43.479940,RIO DE JANEIRO,-23.017473,-43.479940,4440063,119.25,3.22,ONLINE,PAID